# Даны строки S и S0. Проверить, содержится ли строка S0 в строке S.
# Если содержится, то вывести TRUE, если не содержится, то вывести FALSE
S = input("Введите строчку №1:")
S1 = input("Введите строчку №2: ")

if S1 in S:
    print(True)
else:
    print(False)
